Repository: nvdaes/test
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: ne, ru

source: This add-on allows to confirm if you want to copy and cut, replacing the clipboard contents, when pressing control+c and control+x. This is named Emulate copy and cut, and by default it works just when clipboard contains text. Do you want to configure Emulate copy and cut now? You may do or change this later.
ru: Это дополнение позволяет подтверждать, если вы хотите копировать и вырезать, заменив содержимое буфера обмена, при нажатии control+c и control+x. Это называется эмуляция копирования и вырезания, и по умолчанию оно работает только тогда, когда буфер обмена содержит текст. Вы хотите настроить эмуляции копирования и вырезания сейчас? Вы можете сделать это позже.

source: Configure Emulate copy and cut
ru: Сконфигурировать эмуляцию копирования и вырезания

source: Clipboard cleared
ne: क्लीपपाटी खाली गरियो ।
ru: Буфер обмена очищен

source: Clipboard not cleared
ne: क्लीपपाटी खाली गरिएको छैन । ।
ru: Буфер обмена не очищен

source: Start marker set
ne: सुरुवात निसाना कायम
ru: Начальная метка выбрана

source: Marks the current position of the review cursor as the start of text to be appended to the clipboard.
ne: क्लीपपाटीमा थपिने पाठसुरु हुने समीक्षा क्रसरको चालु स्थानलाई सिमाङ्कन गर्छ ।
ru: Отмечает текущее положение курсора обзора как начало текста, который будет добавлен в буфер обмена.

source: No selection. No start marker set
ne: कुनै चयन छैन । सुरुवात सिमाङ्कन छैन ।
ru: Нет выделения. Начальная метка не выбрана

source: The start marker must reside within the same object
ne: सुरुवात सिमाङ्कन उही वस्तुको आकार सित मिल्नु पर्छ ।
ru: Начальная метка должна располагаться в этом же объекте

source: No text to add
ru: Нет текста для добавления

source: Please, confirm if you want to add text to the clipboard
ru: Пожалуйста, подтвердите, что вы хотите добавить текст в буфер обмена

source: Adding text to clipboard
ru: Добавление текста в буфер обмена

source: Added
ru: Добавлен

source: Cannot add
ru: Невозможно добавить

source: Retrieves the selected string or the text from the previously set start marker up to and including the current position of the review cursor, and adds it to the clipboard.
ru: Восстанавливает выбранную строку или текст от ранее установленной начальной метки, вплоть до текущей позиции курсора обзора, и добавляет его в буфер обмена.

source: Please, confirm if you want to clear the clipboard
ru: Пожалуйста, подтвердите, что вы хотите очистить буфер обмена

source: Clearing clipboard
ru: Очистка буфера обмена

source: Deletes the added text and the content of the clipboard.
ru: Удаляет добавленный текст и содержимое буфера обмена.

source: Please, confirm if you want to copy to the clipboard
ru: Пожалуйста, подтвердите, что вы хотите скопировать в буфер обмена

source: Copying to clipboard
ru: Копирование в буфер обмена

source: Copies to the clipboard, with the possibility of being asked for a previous confirmation
ru: Копирует в буфер обмена, с возможностью предварительного запроса подтверждения

source: Please, confirm if you want to cut from the clipboard
ru: Пожалуйста, подтвердите, что вы хотите вырезать в буфер обмена

source: Cutting from clipboard
ru: Вырезание в буфер обмена

source: Cuts from the clipboard, with the possibility of being asked for a previous confirmation
ru: Вырезает в буфер обмена, с возможностью предварительного запроса подтверждения

source: Type the string to be used as a &separator between contents added to the clipboard.
ru: Введите строку для использования в качестве &разделителя между добавляемым содержимым буфера обмена.

source: &Add text before clip data
ru: &Добавить текст перед данными клипа

source: Confirm to a&dd text
ru: Подтвердить &добавление текста

source: Confirm to c&lear clipboard
ru: Подтвердить о&чистку буфера обмена

source: &Confirm to emulate copy
ru: &Подтвердить эмуляцию копировать

source: &Confirm to emulate cut
ru: &Подтвердить эмуляцию вырезать

source: &Text in clipboard to confirm
ru: &Текст в буфере обмена для подтверждения

source: Add-on for managing clipboard text.
ne: क्लीपपाटीका पाठहरूलाई व्यबस्थापन गर्ने उप-कर्मी
ru: Дополнение для управления текстом буфера обмена.

source: You have installed the AppendText add-on, probably an old and incompatible version with this one. Do you want to uninstall the old version?
ne: तपाइले AppendText नामको उप-कर्मीलाई स्थापना गरेको हुनु पर्छ, सम्भवत यो नयाँ संस्करण सित न मिल्दो छ ।Do you want to uninstall the old version?

source: Uninstall incompatible add-on
ne: न मिल्दो उप-कर्मीलाई हटाउ ।

source: You seem to have previous settings saved for this add-on. Do you want to import them?
ne: यो उप-कर्मीका लागि तपाइले पहिले नै अनुकूलता बचत गरेको देखिन्छ । के तपाइ यिनिहरुलाई आयात गर्न चाहनु हुन्छ?

source: Import ClipContentsDesigner add-on settings
ne: क्लिप सामाग्री नमुनाकार उप-कर्मीको अनुकूलन आयात गर ।

source: &Clip Contents Designer settings...
ne: &क्लिप सामाग्री नमुनाकारको अनुकूलन ।

source: Shows the Clip Contents Designer settings dialog.
ne: क्लिप सामाग्री नमुनाकार उपकर्मीको अनुकूलन पातो देखाउने छ।

source: No text to append
ne: थप गर्न कुनै पाठ छैन ।

source: Appended
ne: थपियो ।

source: Cannot append
ne: थप गर्न सकिएन ।

source: Retrieves the selected string or the text from the previously set start marker up to and including the current position of the review cursor, and appends it to the clipboard.
ne: चयन गरिएको पदावलीलाई अथवा पहिले कायम गरिएको पाठ सुरु सिमाङ्कन देखि चालू समीक्षा क्रसरको स्थान सम्मको पाठलाइ प्राप्त गरी क्लिपपाटीमा यसलाई थप गर्छ ।,

source: Deletes the appended text and the content of the clipboard.
ne: थप गरिएको पाठ र क्लीपपाटीको सामाग्रिलाई मेटाउने छ ।

source: Clip Contents Designer settings
ne: क्लिप सामाग्री नमुनाकारको अनुकूलन ।

source: Type the string to be used as a &separator between contents appended to the clipboard.
ne: क्लिपपाटीमा जोडिने सामाग्रीहरूको & विभाजक जनाउने पदावली टङ्कण गर्नु होस् ।

source: &Copy settings
ne: &अनुकूलताको प्रतिलिपी

source: Clip Contents Designer
ne: क्लीप सामाग्री नमुनाकार
